---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.ModelCurveArray
source: html/e88b2eb2-04e7-22a8-b59b-dd452df19e88.htm
---
# ModelCurveArray Members

Initializes a new instance of the ModelCurveArray class